# 货币资金
monetary_funds = ["库存现金","银行存款","其他货币资金"]
# 存货类科目
inventory = ["原材料", "包装物", "低值易耗品", "库存商品", "委托加工物资", "周转材料", "材料采购", "物资采购", "包装物及低值易耗品", "产成品", "主营业务成本"]
# 存货类科目包含税费
inventory_tax = ["原材料", "包装物", "低值易耗品", "库存商品", "委托加工物资", "周转材料", "材料采购", "物资采购", "包装物及低值易耗品", "产成品", "主营业务成本","应交税费"]
# 长期资产类科目
long_term_assets = ["固定资产", "无形资产", "在建工程", "工程物资", "长期待摊费用", "开发支出"]
# 长期资产类科目
long_term_assets_tax = ["固定资产", "无形资产", "在建工程", "工程物资", "长期待摊费用", "开发支出","应交税费"]
# 费用类科目
expense = ["管理费用", "销售费用", "营业费用", "研发费用", "制造费用"]
# 费用类科目包含税费
expense_tax = ["管理费用", "销售费用", "营业费用", "研发费用", "制造费用","应交税费"]
# 收入确认借方标准科目
recognition_income_debit = ["应收账款","库存现金","银行存款","预收款项","合同负债","长期应收款","应收票据"]
# 收入确认贷方标准科目
recognition_income_credit = ["应交税费","主营业务收入"]
# 应收款项
receivables = ["应收账款","预付款项","其他应收款","应收票据"]
# 应付款项
payments = ["应付账款","预收款项","其他应付款","应付票据"]
# 往来款项
receivables_and_payments = ["应收账款","预付款项","其他应收款","应付账款","预收款项","其他应付款"]
# 资产减值准备
asset_impairment = ["坏账准备","存货跌价准备",'可供出售金融资产减值准备',"持有至到期投资减值准备",
                    "长期股权投资减值准备","固定资产减值准备","在建工程减值准备","无形资产减值准备",
                    "商誉减值准备"
                    ]
# 增值税标准销项税率
sale_rate = {
    "1994-1-1":[0.17,0.13,0.06],
    "2017-7-1":[0.17,0.11,0.06],
    "2018-5-1":[0.16,0.10,0.06],
    "2019-4-1":[0.13,0.09,0.06]
}
# 其他业务收入-租赁收入描述
other_income_rent_desc = ["出租","租赁","租金"]
# 利息描述
interest_desc = ["利息","结息"]
# 手续费描述
bank_charges_desc =  ["手续费","服务费"]
# 汇兑损益描述
exchange_desc = ["汇率","汇兑","外币","结汇","兑换","折算"]
# 应收票据减少标准科目名称
notes_receivable_subjects = ["银行存款","财务费用","应收票据","应付账款"]